<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 4 changes.</summary>

```diff
! module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm is tainted, so must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
! module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-11T07:09:59Z [(view log)](https://github.com/perchnet/p/actions/runs/16214080838/job/45779527242#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
              ~ {
                  ~ storage         = {
                      + directories = [
                          + {
                              + group = {}
                              + mode  = 492
                              + path  = "/etc/ucore-autorebase"
                              + user  = {}
                            },
                        ]
                      ~ files       = [
                            # (1 unchanged element hidden)
                            {
                                contents  = {
                                    compression  = ""
                                    source       = "data:,stunning-bear"
                                    verification = {}
                                }
                                group     = {}
                                mode      = 420
                                overwrite = true
                                path      = "/etc/hostname"
                                user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  ~ systemd         = {
                      + units = [
                          + {
                              + contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to unsigned OCI and reboot
                                    ConditionPathExists=!/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                                    ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              + enabled  = true
                              + name     = "ucore-unsigned-autorebase.service"
                            },
                          + {
                              + contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to signed OCI and reboot
                                    ConditionPathExists=/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                                    ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              + enabled  = true
                              + name     = "ucore-signed-autorebase.service"
                            },
                        ]
                    }
                    # (3 unchanged attributes hidden)
                } # forces replacement
            )
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "132" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:82:E8:BA",
        ] -> (known after apply)
        name                    = "stunning-bear"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 132 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = "zssd-files:iso/coreos_testing_proxmoxve_xd9o08.qcow2.xz.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
            # (2 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:82:E8:BA" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
              ~ {
                  ~ storage         = {
                      + directories = [
                          + {
                              + group = {}
                              + mode  = 492
                              + path  = "/etc/ucore-autorebase"
                              + user  = {}
                            },
                        ]
                      ~ files       = [
                            # (1 unchanged element hidden)
                            {
                                contents  = {
                                    compression  = ""
                                    source       = "data:,up-unicorn"
                                    verification = {}
                                }
                                group     = {}
                                mode      = 420
                                overwrite = true
                                path      = "/etc/hostname"
                                user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  ~ systemd         = {
                      + units = [
                          + {
                              + contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to unsigned OCI and reboot
                                    ConditionPathExists=!/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-unverified-registry:ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/unverified
                                    ExecStart=/usr/bin/systemctl disable ucore-unsigned-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              + enabled  = true
                              + name     = "ucore-unsigned-autorebase.service"
                            },
                          + {
                              + contents = <<-EOT
                                    [Unit]
                                    Description=uCore autorebase to signed OCI and reboot
                                    ConditionPathExists=/etc/ucore-autorebase/unverified
                                    ConditionPathExists=!/etc/ucore-autorebase/signed
                                    After=network-online.target
                                    Wants=network-online.target
                                    [Service]
                                    Type=oneshot
                                    StandardOutput=journal+console
                                    ExecStart=/usr/bin/rpm-ostree rebase --bypass-driver ostree-image-signed:docker://ghcr.io/ublue-os/ucore-hci:stable
                                    ExecStart=/usr/bin/touch /etc/ucore-autorebase/signed
                                    ExecStart=/usr/bin/systemctl disable ucore-signed-autorebase.service
                                    ExecStart=/usr/bin/systemctl reboot
                                    [Install]
                                    WantedBy=multi-user.target
                                EOT
                              + enabled  = true
                              + name     = "ucore-signed-autorebase.service"
                            },
                        ]
                    }
                    # (3 unchanged attributes hidden)
                } # forces replacement
            )
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:FF:84:3B",
        ] -> (known after apply)
        name                    = "up-unicorn"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:FF:84:3B" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-21-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->